# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/cask-fonts"
# tap "homebrew/core"
# tap "homebrew/cask-drivers"
# tap "homebrew/services"
tap "heroku/brew"
tap "fwartner/tap"

# Brew CLI apps
brew "gh"
brew "go"
brew "helm"
brew "imagemagick"
brew "kubernetes-cli"
brew "node"
brew "netlify-cli", link: false
brew "tldr"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "heroku/brew/heroku"
brew "mas"
brew "pyenv"
brew "bitwarden-cli"
brew "zsh"
brew "tree"
brew "htop"
brew "speedtest-cli"
brew "wifi-password"
brew "bufbuild/buf/buf"
brew "pip"
brew "nvm"
brew "fwartner/tap/mac-cleanup"

# App casks
cask "authy"
cask "discord"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "raycast"
cask "mysqlworkbench"
cask "sourcetree"
cask "rectangle"
cask "readdle-spark"
cask "bitwarden"
cask "obsidian"
cask "nosqlbooster-for-mongodb"
cask "android-studio"
cask "wire"
cask "numi"

# Mac App Store apps
mas "LINE", id: 539883307
mas "Session - Pomodor Focus Timer", id: 1521432881
mas "Resize Master", id: 1025306797
mas "Xcode", id: 497799835