# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "devopsdays/tap"
tap "heroku/brew"

# Brew CLI apps
brew "gh"
brew "go"
brew "helm"
brew "imagemagick"
brew "kubernetes-cli"
brew "neovim"
brew "node"
brew "netlify-cli", link: false
brew "tldr"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "heroku/brew/heroku"
brew "mas"

# App casks
cask "authy"
cask "discord"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "raycast"
cask "mysqlworkbench"
cask "sourcetree"
cask "rectangle"
cask "readdle-spark"

# Mac App Store apps
mas "LINE", id: 539883307
mas "Session - Pomodor Focus Timer", id: 1521432881
mas "Resize Master", id: 1025306797
